In [287]:
import itertools
import pandas as pd
import numpy as np
import csv

In [288]:
file_path = './data/household05032024/table08.tbw'
out_path = './data/out05032024/table08.csv'
dic_path = './data/CensusMainShortForm_new.dcf'

f = open(file_path, 'r')

In [289]:
dimension = []
all_values = []
all_codes= []
all_rows = []
values = []
area_names = []
area_codes = []

In [290]:
i=1
notFirst=False
while True:
        
        line = f.readline()
        if not line:
            if notFirst:
                all_values.append(values)
            break
        else:
            if line.find('[Variable]') != -1:
                if notFirst:
                    all_values.append(values)
                name = f.readline()
                name = name.replace("\n", "")
                name =  name[5:]
                dimension.append(name)
                values = []
                notFirst = True
            if line.find('[Value]') != -1:
                label = f.readline()
                label = label.replace("\n", "")
                label = label[6:]
                #print(label)
                values.append(label)
            if line.find('AreaName') == 0: 
                area = line[9:]
                #print(area)
                area_names.append(area.strip())
            if line.find('BreakKey') == 0: 
                code = line[9:]
                code = code.replace(';', '')
                #print(area)
                area_codes.append(code.strip())
            if line.find('Row') == 0: 
                #row = f.readline()
                row = line[4:]
                i = i+1
                arr = [ x.strip() for x in row.split('  ')]
                all_rows += arr

In [291]:
all_values

[['%AreaName%'],
 ['Total',
  'None/Never Attended',
  'Other (Informal)',
  'Primary',
  'Secondary',
  'Tertiary',
  'Not Stated/DK'],
 ['Total', 'Yes', 'No', 'DK']]

In [292]:
#print(area_codes)              
#all_values[0] = area_codes                
print(dimension)
#print(area_names)
print(all_values)
#print(all_rows)

['SYSTEM_TOTAL', 'EDUC_COMP_HH_HEAD_VS1', 'H19_3_VS1']
[['%AreaName%'], ['Total', 'None/Never Attended', 'Other (Informal)', 'Primary', 'Secondary', 'Tertiary', 'Not Stated/DK'], ['Total', 'Yes', 'No', 'DK']]

In [293]:
d = open(dic_path, 'r', encoding='utf-8')
header =['cod','desc', 'cod_list']
dim_values = []
total = []
a =  np.empty((0, 3))

def getCodes(d, dim):
    d.seek(0)
    values = []
    dim=dim + "\n"
    while True:
        line = d.readline()
        if not line:
            break
        if line.find(dim) != -1:
            line = d.readline()
            while line.find('Value') != -1:
                line = line.replace("\n", "")
                line = line[6:]
                line = line + ';' + dim
                line = line.replace(':', '-')
                item = line.split(';')
                
                values.append(item)
                line = d.readline()
                if line.find('Note=') != -1:
                    line = d.readline()
    return values


for dim in dimension[1:]:
    values = getCodes(d, dim)
    total = ['T', 'Total', dim]
    values.append(total)
    print(values)
    print("\n")
    a = np.concatenate((a, values), axis=0)

[['1', 'None/Never Attended', 'EDUC_COMP_HH_HEAD_VS1\n'], ['2', 'Other (Informal)', 'EDUC_COMP_HH_HEAD_VS1\n'], ['3', 'Primary', 'EDUC_COMP_HH_HEAD_VS1\n'], ['4', 'Secondary', 'EDUC_COMP_HH_HEAD_VS1\n'], ['5', 'Tertiary', 'EDUC_COMP_HH_HEAD_VS1\n'], ['6', 'Not Stated/DK', 'EDUC_COMP_HH_HEAD_VS1\n'], ['T', 'Total', 'EDUC_COMP_HH_HEAD_VS1']]


[['1', 'Yes', 'H19_3_VS1\n'], ['2', 'No', 'H19_3_VS1\n'], ['9', 'DK', 'H19_3_VS1\n'], ['T', 'Total', 'H19_3_VS1']]

In [294]:
a

array([['1', 'None/Never Attended', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['2', 'Other (Informal)', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['3', 'Primary', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['4', 'Secondary', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['5', 'Tertiary', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['6', 'Not Stated/DK', 'EDUC_COMP_HH_HEAD_VS1\n'],
       ['T', 'Total', 'EDUC_COMP_HH_HEAD_VS1'],
       ['1', 'Yes', 'H19_3_VS1\n'],
       ['2', 'No', 'H19_3_VS1\n'],
       ['9', 'DK', 'H19_3_VS1\n'],
       ['T', 'Total', 'H19_3_VS1']], dtype='<U32')

In [295]:
#top level territorial dimension
area_codes[0]='00'
area_codes

['00',
 '01',
 '0101',
 '0102',
 '0103',
 '0104',
 '0105',
 '0106',
 '02',
 '0201',
 '0202',
 '0203',
 '0204',
 '0205',
 '03',
 '0301',
 '0302',
 '0303',
 '0304',
 '0305',
 '0306',
 '0307',
 '0308',
 '0309',
 '04',
 '0401',
 '0402',
 '0403',
 '05',
 '0501',
 '0502',
 '06',
 '0601',
 '0602',
 '0603',
 '0604',
 '07',
 '0701',
 '0702',
 '0703',
 '0704',
 '0705',
 '0706',
 '0707',
 '08',
 '0801',
 '0802',
 '0803',
 '0804',
 '0805',
 '0806',
 '0807',
 '0808',
 '09',
 '0901',
 '0902',
 '0903',
 '0904',
 '0905',
 '0906',
 '0907',
 '10',
 '1001',
 '1002',
 '1003',
 '1004',
 '1005',
 '1006',
 '1007',
 '11',
 '1101',
 '1102',
 '1103',
 '12',
 '1201',
 '1202',
 '1203',
 '1204',
 '1205',
 '1206',
 '1207',
 '1208',
 '1209',
 '1210',
 '1211',
 '1212',
 '1213',
 '13',
 '1301',
 '1302',
 '1303',
 '1304',
 '1305',
 '1306',
 '14',
 '1401',
 '1402',
 '1403',
 '1404',
 '1405',
 '1406',
 '15',
 '1501',
 '1502',
 '1503',
 '1504',
 '1505',
 '1506',
 '1507',
 '1508',
 '1509',
 '1510',
 '1511',
 '1512',
 '1513',
 '1514',
 '1515',
 '1516',
 '1517',
 '1518',
 '16',
 '1601',
 '1602',
 '1603',
 '1604',
 '1605',
 '1606',
 '1607',
 '1608',
 '1609',
 '17',
 '1701',
 '1702',
 '1703',
 '1704',
 '1705',
 '1706',
 '1707',
 '1708',
 '1709',
 '18',
 '1801',
 '1802',
 '1803',
 '1804',
 '1805',
 '1806',
 '1807',
 '1808',
 '19',
 '1901',
 '1902',
 '1903',
 '1904',
 '1905',
 '1906',
 '1907',
 '1908',
 '1909',
 '1910',
 '20',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '21',
 '2101',
 '2102',
 '2103',
 '2104',
 '2105',
 '2106',
 '2107',
 '2108',
 '2109',
 '22',
 '2201',
 '2202',
 '2203',
 '2204',
 '2205',
 '2206',
 '2207',
 '2208',
 '2209',
 '2210',
 '2211',
 '2212',
 '2213',
 '23',
 '2301',
 '2302',
 '2303',
 '2304',
 '2305',
 '2306',
 '2307',
 '24',
 '2401',
 '2402',
 '2403',
 '2404',
 '2405',
 '25',
 '2501',
 '2502',
 '2503',
 '26',
 '2601',
 '2602',
 '2603',
 '2604',
 '2605',
 '27',
 '2701',
 '2702',
 '2703',
 '2704',
 '2705',
 '2706',
 '28',
 '2801',
 '2802',
 '2803',
 '2804',
 '29',
 '2901',
 '2902',
 '2903',
 '2904',
 '2905',
 '2906',
 '30',
 '3001',
 '3002',
 '3003',
 '3004',
 '3005',
 '3006',
 '3007',
 '31',
 '3101',
 '3102',
 '3103',
 '3104',
 '3105',
 '32',
 '3201',
 '3202',
 '3203',
 '3204',
 '3205',
 '3206',
 '3207',
 '3208',
 '3209',
 '3210',
 '3211',
 '33',
 '3301',
 '3302',
 '3303',
 '3304',
 '3305',
 '3306',
 '3307',
 '34',
 '3401',
 '3402',
 '3403',
 '3404',
 '3405',
 '3406',
 '35',
 '3501',
 '3502',
 '3503',
 '3504',
 '3505',
 '3506',
 '36',
 '3601',
 '3602',
 '3603',
 '3604',
 '3605',
 '37',
 '3701',
 '3702',
 '3703',
 '3704',
 '3705',
 '3706',
 '3707',
 '3708',
 '3709',
 '3710',
 '3711',
 '3712',
 '3713',
 '38',
 '3801',
 '3802',
 '3803',
 '3804',
 '3805',
 '3806',
 '39',
 '3901',
 '3902',
 '3903',
 '3904',
 '3905',
 '3906',
 '3907',
 '3908',
 '3909',
 '3910',
 '3911',
 '3912',
 '40',
 '4001',
 '4002',
 '4003',
 '4004',
 '4005',
 '4006',
 '4007',
 '41',
 '4101',
 '4102',
 '4103',
 '4104',
 '4105',
 '4106',
 '42',
 '4201',
 '4202',
 '4203',
 '4204',
 '4205',
 '4206',
 '4207',
 '43',
 '4301',
 '4302',
 '4303',
 '4304',
 '4305',
 '4306',
 '4307',
 '4308',
 '44',
 '4401',
 '4402',
 '4403',
 '4404',
 '4405',
 '4406',
 '4407',
 '4408',
 '45',
 '4501',
 '4502',
 '4503',
 '4504',
 '4505',
 '4506',
 '4507',
 '4508',
 '4509',
 '4510',
 '4511',
 '46',
 '4601',
 '4602',
 '4603',
 '4604',
 '4605',
 '47',
 '4701',
 '4702',
 '4703',
 '4704',
 '4705',
 '4706',
 '4707',
 '4708',
 '4709',
 '4710',
 '4711']

In [296]:
area_varname = [dimension[0]] * len(area_codes)

In [297]:
b = np.column_stack((area_codes, area_names, area_varname))

In [298]:
b

array([['00', 'Kenya', 'SYSTEM_TOTAL'],
       ['01', 'Mombasa', 'SYSTEM_TOTAL'],
       ['0101', 'Changamwe', 'SYSTEM_TOTAL'],
       ...,
       ['4709', 'Njiru', 'SYSTEM_TOTAL'],
       ['4710', 'Starehe', 'SYSTEM_TOTAL'],
       ['4711', 'Westlands', 'SYSTEM_TOTAL']], dtype='<U22')

In [299]:
c = np.concatenate((b, a), axis=0)

codes = pd.DataFrame(c)

codes.columns =  header

codes

      cod       desc               cod_list
0      00      Kenya           SYSTEM_TOTAL
1      01    Mombasa           SYSTEM_TOTAL
2    0101  Changamwe           SYSTEM_TOTAL
3    0102      Jomvu           SYSTEM_TOTAL
4    0103    Kisauni           SYSTEM_TOTAL
..    ...        ...                    ...
399     T      Total  EDUC_COMP_HH_HEAD_VS1
400     1        Yes            H19_3_VS1\n
401     2         No            H19_3_VS1\n
402     9         DK            H19_3_VS1\n
403     T      Total              H19_3_VS1

[404 rows x 3 columns]

In [300]:
codes['cod_list'].replace(regex=True,inplace=True,to_replace=r'\n',value=r'')
codes

      cod       desc               cod_list
0      00      Kenya           SYSTEM_TOTAL
1      01    Mombasa           SYSTEM_TOTAL
2    0101  Changamwe           SYSTEM_TOTAL
3    0102      Jomvu           SYSTEM_TOTAL
4    0103    Kisauni           SYSTEM_TOTAL
..    ...        ...                    ...
399     T      Total  EDUC_COMP_HH_HEAD_VS1
400     1        Yes              H19_3_VS1
401     2         No              H19_3_VS1
402     9         DK              H19_3_VS1
403     T      Total              H19_3_VS1

[404 rows x 3 columns]

In [301]:
all_codes = []
all_codes.append(area_codes)

for i, dim in enumerate(dimension[1:]):
    #print(i, dim)
    arr_cod = []
    for arr in all_values[i+1]:

        d =  ''
        result = codes.loc[(codes['cod_list'] == dim) & (codes['desc'] == arr)]
        try:
            d = result['cod'].values[0]
            arr_cod.append(d)
        except:
            pass
    print(len(arr_cod))
    all_codes.append(arr_cod)

7
4

In [302]:
result = list(itertools.product(*all_codes))

print(len(result))

11004

In [303]:
df = pd.DataFrame(result)
df.columns = dimension
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11004 entries, 0 to 11003
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   SYSTEM_TOTAL           11004 non-null  object
 1   EDUC_COMP_HH_HEAD_VS1  11004 non-null  object
 2   H19_3_VS1              11004 non-null  object
dtypes: object(3)
memory usage: 258.0+ KB

In [304]:
len(all_rows)

11004

In [305]:
df['VALUES'] = all_rows
df['VALUES'] = df['VALUES'].str.replace(',000000000', '')
df

      SYSTEM_TOTAL EDUC_COMP_HH_HEAD_VS1 H19_3_VS1    VALUES
0               00                     T         T  12040701
1               00                     T         1     23519
2               00                     T         2  11992666
3               00                     T         9     24516
4               00                     1         T   2130090
...            ...                   ...       ...       ...
10999         4711                     5         9        20
11000         4711                     6         T      1488
11001         4711                     6         1
11002         4711                     6         2      1472
11003         4711                     6         9        16

[11004 rows x 4 columns]

In [306]:
codes

      cod       desc               cod_list
0      00      Kenya           SYSTEM_TOTAL
1      01    Mombasa           SYSTEM_TOTAL
2    0101  Changamwe           SYSTEM_TOTAL
3    0102      Jomvu           SYSTEM_TOTAL
4    0103    Kisauni           SYSTEM_TOTAL
..    ...        ...                    ...
399     T      Total  EDUC_COMP_HH_HEAD_VS1
400     1        Yes              H19_3_VS1
401     2         No              H19_3_VS1
402     9         DK              H19_3_VS1
403     T      Total              H19_3_VS1

[404 rows x 3 columns]

In [307]:
d = codes.loc[codes['cod_list']=='SYSTEM_TOTAL']
d

      cod       desc      cod_list
0      00      Kenya  SYSTEM_TOTAL
1      01    Mombasa  SYSTEM_TOTAL
2    0101  Changamwe  SYSTEM_TOTAL
3    0102      Jomvu  SYSTEM_TOTAL
4    0103    Kisauni  SYSTEM_TOTAL
..    ...        ...           ...
388  4707   Makadara  SYSTEM_TOTAL
389  4708    Mathare  SYSTEM_TOTAL
390  4709      Njiru  SYSTEM_TOTAL
391  4710    Starehe  SYSTEM_TOTAL
392  4711  Westlands  SYSTEM_TOTAL

[393 rows x 3 columns]

In [308]:
for cod in dimension:
    
    cod_col = 'DESC_'+cod
    print(cod)
    d = codes.loc[codes['cod_list']==cod]
    df = pd.merge(df, d, how='inner', left_on=cod, right_on='cod')
    df = df.drop('cod', axis=1)
    df = df.drop('cod_list', axis=1)
    df.rename(columns={'desc': cod_col}, inplace=True) 
df

SYSTEM_TOTAL
EDUC_COMP_HH_HEAD_VS1
H19_3_VS1

,SYSTEM_TOTAL,EDUC_COMP_HH_HEAD_VS1,H19_3_VS1,VALUES,DESC_SYSTEM_TOTAL,DESC_EDUC_COMP_HH_HEAD_VS1,DESC_H19_3_VS1
0,00,T,T,12040701,Kenya,Total,Total
1,01,T,T,376212,Mombasa,Total,Total
2,0101,T,T,46437,Changamwe,Total,Total
3,0102,T,T,53209,Jomvu,Total,Total
4,0103,T,T,88128,Kisauni,Total,Total
...,...,...,...,...,...,...,...
10999,4707,6,9,75,Makadara,Not Stated/DK,DK
11000,4708,6,9,3,Mathare,Not Stated/DK,DK
11001,4709,6,9,27,Njiru,Not Stated/DK,DK
11002,4710,6,9,11,Starehe,Not Stated/DK,DK
11003,4711,6,9,16,Westlands,Not Stated/DK,DK

In [309]:
df.to_csv(out_path, index=True, index_label='id')